benchmark_results_replicated/20260423_101844/analysis/rep19/run/rust_heavy_c10/wrk_output.txt
Running 1m test @ http://localhost:8081/days-since-heavy
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  150.12us   4.87ms   79.10%
    Req/Sec     1.74k    70.00     1.90k    74.83%
  Latency Distribution
     50%    1.11ms
     75%    1.21ms
     90%    1.35ms
     99%    1.62ms
  415340 requests in 1.00m, 55.45MB read
Requests/sec:   6920.02
Transfer/sec:      0.92MB
P95: 1419
P99: 1622